{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [5, 5, 1, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [2304, 72]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [72]}], "paths": ["group3-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "dense_2/kernel", "shape": [72, 46]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [46]}], "paths": ["group4-shard1of1"]}], "modelTopology": {"training_config": {"loss": "categorical_crossentropy", "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "loss_weights": null, "metrics": ["accuracy"]}, "keras_version": "2.2.0", "backend": "tensorflow", "model_config": {"config": [{"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 32, 32, 1], "data_format": "channels_last", "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "filters": 32, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 14, 14, 1], "data_format": "channels_last", "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "filters": 64, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "units": 72, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "units": 46, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}}}